["Chair", "By", "(ELBS)", "adjusted", "technologies.", "had", "Particularly,", "changed", "environments,''", "U.", "composed", "explosive", "theory", "[15].", "Storage,", "China.", "Power", "lower", "homes,", "ture's", "acts", "environmental", "3G,", "[37].", "higher", "reliability.", "nol.,", "stability", "nological", "WSN:", "Yaqoob,", "Master", "13,", "1454\u00151464,", "now", "falls", "massive", "[3].", "Kose.assistants,", "run-time", "MOHD", "Hence,", "75973T.-A.", "End-to-", "[67]", "due", "reviews,''", "[53].", "Alternating", "large-scale", "hotness", "75962", "Wang,", "sequential", "well", "283\u0015294,", "Syst.", "Rosilah", "(rosilah@ukm.edu.my)", "recognition,", "occur", "placed", "J.", "Comput.", "8.", "comprises", "hierar-", "Anand,", "linked", "constraints", "down", "performing", "reassignment", "Development.", "little", "Liverpool,", "journals", "augmented", "Though", "functions", "regions,", "conjunction", "static", "``Exploring", "(MANET),", "relatively", "nodes", "opposed", "De", "gateway", "[50].", "reinforcement", "nodes,", "threats,", "youngest", "2.", "shorter,", "(ETSI)", "puting,''", "(ICCIS),", "(SocialCom),", "buses", "Madari,", "random", "Centre", "(ICCMC),", "7543\u00157554,", "chains,", "10.3389/fphy.2020.00358.", "ter-", "smartphones", "AREAS", "ltering,", "Quek,", "Mankodiya,", "EFFICIENCY", "Zheng,", "timer,", "3:", "(MINLP)", "choose", "Electr.,", "supports", "Malaysian", "emerging", "2016,", "open", "science", "cars'", "169-0051,", "concepts:", "2014,", "things", "situation", "1457\u00151477,", "joining", "computing,", "locality", "implementations", "ulate", "section", "parties.", "analysis", "scenarios,", "(Green", "only", "2%", "all", "exchanges", "(ICETCCT),", "(GPS),", "limitations,", "studies", "investi-", "needed", "measurements,", "Kadiyala,", "apply", "imposed", "explained", "timely", "Pham,", "similar", "MCC", "recognized", "decreas-", "Dama\u00b2evi\u00a3ius,", "servers", "delayand", "toward", "technology", "expression", "A", "[24].", "``Integration", "[61]", "node", "Niakanlahiji,", "task.", "accounts", "EC,", "Path", "[79].", "depicts", "Morais,", "(x2C1)", "electricity,", "concerning", "respond", "Oct.", "Las", "Addepalli,", "monitor,", "notable", "compressing", "x2R(x2C1)", "study,''", "Nguyen", "nearly", "[50]", "external", "he", "Nguyen,", "analyze", "transit", "concept.", "access,", "resulted", "[112].", "Trans.", "EDGE", "traces", "Khartoum,", "run,", "air", "preferable", "Universiti", "Conf.", "by", "HASSAN", "battery-powered", "[95].", "Wills,", "Rif", "combinatorial", "(CFC).", "vey,''", "DIP-2018-040", "\u000fDe", "ti", "city,''", "monitors", "era", "75978", "network.", "investigate", "elaborate", "e.g.,", "[105].", "USA,", "Paci", "calculations", "Netw.,", "Darwich,", "Member,", "correlated", "motivated", "develop", "lightweight,", "through,", "avoid", "IoT.", "out", "us", "(ITU)", "Networking", "G.", "channels", "do", "1\u001512.", "[107]", "interest", "providers'", "given", "Malaysia.", "resolving", "Dong,", "feasible", "papers", "automation", "promising", "responsiveness", "expense.", "versatility", "source", "geo-distributed", "computing).", "redirects,", "1222\u00151228.", "useful", "cloud-to-whatever", "gaps", "icant", "Baccarelli", "long", "implications,''", "site", "each", "preparation", "[109],", "mizes", "independent", "poles,", "10.1109/TITS.2020.3044177.", "University", "reveal", "Wi-Fi", "(PTIT),", "IaaS,", "ques-", "growing", "formulae", "(RSU).", "Prototype", "Skala,", "services,''", "sector", "[4].", "Sustain.", "distribution,", "1,", "Steffenel", "multi-hop,", "serves", "cation.", "consuming", "terminal", "converging", "surveillance,", "meta-heuristic", "hand,", "activities,", "operational", "THINGS", "tinuous", "applications,''", "IoT\u0016A", "cessing", "idle", "Sys-", "saving", "Kanhere,", "storing", "consumption,", "Hospitals:", "errors", "methods", "users", "requested", "system,''", "Daga,", "``From", "designed", "April", "platforms,''", "mobiles,", "Asia", "idea", "promises", "web", "1997,", "real-time,", "micro-seconds", "sim-", "cus-", "edge", "[29].", "permanent", "2052\u00152063,", "al.", "transfer", "authentication,", "concerns.", "ments", "involved", "Montieri,", "B", "scalable", "consump-", "(V", "Things", "extraction,''", "micro", "scripts", "Nishiyama,", "Saini,", "intervention.", "[67].", "[112]", "Arabia,", "man-", "includes", "75968", "Communication", "VIII.", "21\u001526,", "persistence", "Hong,", "Studies", "Nets48225.2019.9069760.", "tionality,", "optimally", "denotes", "projects,", "optimum", "(Senior", "computing-overview.pdf", "addresses", "oppor-", "gency", "(ICCE),", "License.", "10.1109/BDCloud.2018.00144.", "Energy-ef", "smooth", "Also,", "this", "modular", "10.1109/ICCE.2019.8661909.", "Art.", "format", "face", "recipient", "75977T.-A.", "actual", "tions:", "Fez,", "(NCT)", "00040.", "central", "allel", "When", "active", "1\u00155,", "Germany:", "CFC", "safer.", "node,", "comprise", "about", "fog-computing", "Groups,", "required", "congestion,", "concepts", "(2),", "Kotagiri,", "[96]", "ensure", "[8]", "again", "[72]", "temperature,", "10.1109/BDCloud-SocialCom-", "[51]", "behavior", "provided", "simulate", "Jararweh,", "Eds.", "[17]", "The", "Lastly", "Real-time", "would", "Zhu,", "Kumar,", "Bhubaneswar,", "(MOO),", "rst", "Al", "Advantages,", "cost.The", "Graduate", "(SRQ).", "Cognit.", "lies", "Member", "CITIES", "operation", "ARCHITECTURE", "than", "Thakur", "Researchers", "relaying", "common", "[39].", "lifetime", "either", "Scheduling", "Tjoa,", "resource", "call", "seven:", "Dependable,", "28th", "reduction", "Google", "Bittencourt,", "evaluation,", "Despite", "wide", "[15]", "SustainCom.2016.14.", "occurs", "control,", "conduct", "mization,''", "[68]", "Chang,", "relies", "[96].", "HOMES", "Maklumat", "ideal", "suggests", "[89].", "cally", "end-device,", "Technically,", "``Mobility-aware", "contributes", "services", "storage.", "request,", "(PerCom", "Saxena,", "select", "previous", "Naha", "telecommunication", "fact,", "industry", "13.", "limitation.", "assisted-IoT", "Things\u0016An", "ful", "study,", "5G", "Black", "unforeseen", "2021T.-A.", "pollution,", "Australia,", "Interna-", "making,", "Soc.,", "ing:", "described", "Surveys", "invention", "editor", "standards", "features.", "vehicles", "LOW", "limited", "four,", "monitor-", "networking,", "10.1109/CIT/IUCC/DASC/PICOM.2015.51.", "latency", "t", "Mater.", "Sadok,", "reports", "Conference", "systems", "Seoul,", "essential", "streaming", "patient's", "workshop", "communica-", "young", "Kawamoto,", "models", "Lu\u00eds,", "(SEGE),", "(IoV),", "exists", "[26].", "main", "rely", "justi", "work", "interference.", "increase", "transferring", "Review,", "networks", "balance", "gadgets", "maintains", "huge", "home", "723\u0015737,", "pursuing", "learning", "including", "question,", "`things'", "development", "sensitive", "big", "applications,", "modules", "strat-", "27,", "speed", "cooperation", "Telecommunication", "Sivasanker.,", "solution,", "Biswas,", "four", "layer,", "dle", "criminal", "Zigbee,", "OPEN", "their", "Zhang,", "cities,''", "(IoT)", "plants,", "there", "eligible", "Applications", "Rev.,", "Morocco,", "on-demand.", "factory,''", "directions", "alternative", "(PPS),", "al.:", "assess", "Besides", "track", "[76].", "narrowed", "Thus,", "Critical", "[5].", "surgeries,", "patients,", "tions''),", "demonstrated", "categories", "logistics", "50384\u001550393,", "Hot", "Conf.,", "load-balancing.", "be", "customers.", "challenging", "1554,", "it", "motivate", "maximum", "Macedonia,", "architectures,''", "expects", "lenges", "tion,", "enhance", "critical,", "agents", "tackle", "Ota,", "La,", "Instead", "[21].", "tracks", "Survey", "speci-", "(GoD)", "perspective,''", "ON", "computationally", "service", "facilitates", "ow", "cities", "accuracy.", "ABSTRACT", "existing", "period,", "ed", "identify", "concept,", "practical", "doi:10.1109/GLOCOM.2017.8254207.", "channel", "Real-Time", "location", "challenge", "resources", "5,", "strong", "informative", "``Cloud", "sends", "almost", "small", "up-to-date", "users.", "image", "performance,", "We", "Tri,", "Ricardo,", "describes", "nearby", "cloud's", "Access,", "[78]", "health", "2015.", "Suggested", "high-performance", "1.", "approach,''", "wind", "incessant.", "reduction,''", "ically,", "capabilities", "occur-", "spatial", "Qin,", "An", "substantial", "concepts,", "elements", "xed", "[25]", "example,", "combine", "all-around", "movement", "synchronization", "subset", "networking:", "Analytics.", "entity's", "architectures,", "resource-hungry", "Bayoumi,", "ITU", "cover", "devices", "shows", "[72].", "gener-", "75974", "re", "ple,", "levels.", "infrastructure", "promise", "billions", "privacy", "Hu,", "(FC)", "Keynote", "characteristics.", "cient,", "cloud.", "combines", "ture.", "refer", "options", "facility,", "Identifier", "serving", "DEFINITION", "Areas", "consumers", "Horizon", "plement", "shopping", "distribute", "international", "summarization", "Cost", "activities.", "Rashid,", "guaranteed", "respiratory", "add", "enhancements", "phases.", "Workshops),", "Sep.", "approving", "surveyed", "Cirani,", "everything:", "Gayta,", "(DMGA)", "Borthakur,", "20", "centralized", "Figure", "Dubey,", "Computing'')", "Therefore,", "fore,", "last", "Amendola,", "Syst.,", "summarize", "carefully", "[69].", "Serbia,", "reviewed", "result,", "anywhere.", "device,", "34,", "Rep.,", "explosively", "Islamic", "[83]", "part", "videos,", "ers", "``Comparison", "arrange", "prototype", "Parallel", "controller", "``Optimized", "optimized", "hierarchy", "integral", "sum.", "over", "75979T.-A.", "Industry", "Committee", "Davidovi\u00a2,", "Fakulti", "11", "Everything.", "servers,", "Author", "Load", "health-", "storage", "accessible", "21,", "key", "deploying", "termed", "Before", "portable", "Qolomany,", "niques", "range", "include", "\u000fWearable", "viewers", "low-cost", "delay", "articles", "(CRC),", "priority", "lights,", "Applica-", "sandboxing", "interconnected", "Architecture", "327,", "algorithm.", "``Time", "Arti", "[28].", "decentralized", "content-aware", "Iotti,", "357\u0015361,", "ll", "system's", "Technologies", "system", "slicing,", "expect", "MEC", "Vaquero", "customized", "Algimantas", "impacts", "(ICFEC),", "Ad-hock", "interests", "life.", "pressure", "degree", "(RREQ)", "algorithm,", "Communications", "proposing", "43600,", "enormousmonetary", "facility", "6", "Feedback", "nities,''", "integrates", "Qadir,", "10.1109/ICCISci.2019.8716429.", "haze", "Shi,", "heavily", "networks,''", "distributed", "intervention", "connected", "Liljeberg,", "mild", "sub-storage,", "(NRT)", "growth", "37\u001542.", "Wan,", "limited,", "these", "Such", "140\u0015144.", "three:", "multi-cast", "estimation", "discharged", "Applications,", "repeated", "356\u0015363,", "57\u001563.", "Internet-of-Things:", "version", "Abdali,", "ambulance", "gle", "anonymous", "TAJ-ALDEEN", "forensics,''", "c,", "Web", "Japan.", "sup-", "model", "electronic", "[53]", "namely", "interested", "together.", "ve", "solved", "Qiu,", "mid-", "vehicle-to-vehicle", "nancial,", "optimization,", "duct", "[1]", "[45]", "[47]", "Melnik,", "Dalian,", "Dastjerdi", "lighting", "Quadri,", "V.", "To", "[13]", "Organizing", "Step", "proposals", "[62]", "Comparison", "(WoS).", "human-driven", "enhancing", "subject", "data", "2017,", "demands.", "respectively,", "trans-", "prob-", "supplied", "tained", "Jun.", "high-security", "Balasubramanian,", "keywords", "perspective.", "Taneja", "centers,", "Real", "method,", "terms", "requests", "Scholar,", "connectivity,", "[66]", "location-based", "Electronics,", "helps", "interacting", "categories.", "Two", "communications,", "compared", "granularity", "scenario", "data).", "processing", "WEB", "Paper,", "Appl.,", "Osterberg,", "name", "consisting", "group", "(aggregation,", "experts", "Apr.", "cached", "Available:", "motivating", "FRGS/1/2018/TK04/UKM/02/17.", "Negi,", "Guizani,", "tags,", "pressing", "taxonomy", "[60].", "achieved", "Xiang,", "overview", "73\u001578.", "phones,", "assessments", "threshold", "conventional", "STREAMING", "strategy", "brings", "Ning,", "Ramamohanarao,", "He", "major", "mitigate", "mental,", "[106]", "exclusively", "uploaded", "Questions.", "Du,", "PaaS,", "(SustainCom)", "restrictions.", "elaboration", "varying", "Italy,", "[56].", "Technol.", "13", "Digital", "any", "Huang,", "Primer.", "10.1109/CFEC.2019.8733154.", "College,", "continuously", "Secur.", "performs", "success.", "exe-", "gation", "sur-", "Control:", "(PaaS)", "been", "delivery", "opti-", "care", "Congestion", "covered", "does", "Canada,", "nodes.The", "to", "tracking", "However,", "Computing's", "controls", "Meeting", "UKMnet", "``Clarifying", "3\u00159,", "minimization", "Fog.", "elaborates", "proper", "interaction", "capability", "connecting", "``For-", "doi:", "2017.[86]", "81\u001589.", "Huh,", "present", "interest.", "Summary", "next", "difference", "Engineering,", "predicts", "players", "\u0092ojat,", "issues", "compression", "U.K.", "``Multiobjective", "[103]", "14,", "TECHNOLOGICAL", "enormous", "Korea,", "Fairness", "Posts", "they", "gence", "O.", "secured", "ciently.", "protection.", "safe,", "ANET)", "information-centric", "similarities.", "Sensor", "[23]", "minimum", "REAL-TIME", "Lancellotti,", "[26]", "``Cloudlet", "functions,", "Technology.", "Sym-", "worked", "topology,", "simultaneously", "some", "core", "Compared", "medical", "directions,''", "unas,", "(OCM)", "5G!", "migration", "GAMES", "Mukherjee,", "cations", "Xiong,", "Trivodaliev,", "Conf", "Expe-", "national", "paradigms,", "monitor", "missing", "stress", "applications.", "2018,", "Dhelim,", "Platform", "Cyprus,", "low-latency", "drones,", "same", "2)", "associate", "(BDCloud),", "architecture", "cho-", "mean", "automatic", "suffer", "realizes", "sole", "Digit.", "X.-Q.", "broadcasting", "eral", "Methodol.", "hosting", "San", "[39]", "W.-J.", "collecting", "uations,", "every", "optimiza-", "pre-processing,", "MEC,", "Corresponding", "monitoring", "node's", "private", "tive", "doi:10.1109/ICCMC.2019.8819633.", "preparing", "quickly.", "Hinton,", "opments.", "incentive", "R,", "C", "unconnected", "cost-and", "Chandak", "physical", "cluster", "\u000fHealthcare", "environment", "evaluations.", "post-fog", "4G,", "no.", "requirement", "2021This", "Round-Trip", "players.", "examples,", "ABDALI", "models.", "cution,", "metric", "intermediary", "``Optimizing", "Rapid", "of", "tackled", "demand.", "six:", "whole", "duration", "Helping", "Abtahi,", "risk", "ACM,", "``Fog", "Computer", "[97].", "building", "chal-", "Physical", "Cordeschi,", "ICT,", "Embedded", "keep", "routines", "Erode,", "AZANA", "context", "2013", "researchers,", "operator's", "OF", "mini-", "devices,''", "identi", "unprocessed", "numerous", "infected", "``Hyper-angle", "[98]", "(NTP),", "old,", "Side", "Atlanta,", "Linux", "providing", "showed", "proximity,", "Global", "2005", "especially", "[84].", "workload,", "emergency", "``Improving", "Sobh,", "videos", "diverse", "successful", "``Dew", "installation", "encoding", "presence", "Computing,", "layers,", "Telecom-", "stand-alone", "effectiveness", "searching", "1\u001513,", "NV,", "siderations", "``Trust-based", "ability", "researchers,''", "ticipated", "SUMMARY", "or", "carry", "First,", "available", "features", "551.", "caring", "Kong,", "patient", "Issues", "activities", "1Centre", "infrastructure,", "resources.", "connection.", "Link", "incident", "MCPF", "Kalbande,", "Engineer", "10.1109/COMP-", "communicate.", "Diaz-Montes,", "Zhou,", "FC", "fair", "framework", "SHS", "packets.", "Technologists", "risking", "Device", "problems.", "exam-", "optimal", "Rudrawar,", "Fundamental", "forwarded", "(Cloudnet),", "restricted", "National", "applied", "Mittal,", "super-nodes", "Casablanca,", "(IoT).", "exibility,", "faculties", "mandatory", "VII.", "Shojafar,", "trates", "scripts,", "11,", "-", "local-", "Sci.,", "focused", "Cisco,", "PTIT.", "workable", "Naboulsi,", "third-party", "tasks.", "covering", "Tyagi,", "Alliance", "cost,", "probability", "Com-", "III.", "secure", "Opportunities", "Firstly,", "GREENS),", "packet", "appropriate", "Senior", "Wireless", "Jalali,", "interface", "II.", "compression)", "(MAC)", "``Security", "4.0,''", "Kitanov", "introduced", "lately", "Simultane-", "supply", "Netw.", "End", "[1].", "were", "corresponding", "computation-intensive", "tributed", "[22]", "nected", "India,", "Resilience", "281\u0015321.", "must", "IoT,", "concerns", "capacities", "cozy", "[98].", "eld", "supervised", "(FCSD)", "mun.", "[88].", "six", "Commun.,", "dissension-based", "reception", "10.1109/TETC.2019.2902661.", "spread", "Reiff-Marganiec,", "Chamola,", "Risso,", "scenarios,''", "high-quality", "two:", "IEEE)", "Monteiro,", "Amin,", "116974\u0015117017,", "apps,", "algorithms", "usually", "ible", "\u000fSmart", "costs.", "1106\u00151111,", "75963T.-A.", "oasis", "city", "Constant", "compliance", "Through", "cations,''", "assigns", "industrial", "Ranjan,", "Cheng,", "out-", "typical", "[63]", "decides", "designing", "Calheiros,", "Kulkami,", "actuators,", "built", "ous", "(Row", "rates", "return", "Fathi,", "used.", "Adv.", "taking", "renting", "416\u0015464,", "Dr.", "Internet,", "10.1109/ISC246665.2019.9071674.", "Creative", "via", "3to", "RECENT", "(E2E)", "avoiding", "patrolling", "occurred.", "Jia,", "transmission", "result", "presented", "server,", "28\u001530,", "Issues.", "EU-Japan", "powerful", "following", "management.", "comes", "middle", "processing,", "general", "Federation", "5th", "Medical", "X.", "Since", "[28]", "nition", "[104]", "pro", "[24]", "activated", "Failures", "Social", "particle", "UKM", "4IR,", "[34].", "smart", "per-", "(``Fog", "generating", "platforms.", "con-", "[51].", "Consum.", "U.K.,", "networking.", "Ishigaki,", "critical", "Wei,", "clouds,", "absence.", "processing.", "75972", "litera-", "Devadkar", "bringing", "Pisa,", "single", "Commun.", "journals.", "cost", "[8].", "matching", "positive", "tunity", "thus,", "developed", "ScienceDirect,", "Drones", "nectivity", "9th", "convergence", "7", "served", "[41].", "Ubiquitous", "2020", "face,", "conditions", "Index", "Niu,", "Faculty", "[35]", "merits,", "market", "Every", "Overall,", "Hwang,", "information.", "culties,", "energy-aware", "make", "4603\u00154611,", "link", "4548\u00154556,", "Zeadally,", "very", "(BLE),", "parameters", "[33]", "2015-2020.", "(PSO)", "report,", "energy.", "cient", "Ahmad,", "Constant,", "date", "IoT-enabled", "structure", "3rd", "[22].", "category", "viability", "aware-", "aided", "x", "Sood,", "[62].", "emer-", "beyond:", "constrained", "With", "Sale", "tering,", "proposed,", "May", "Maskeli", "Meanwhile,", "Reports", "[54].", "Chen,", "years", "smaller", "Dec.", "areas", "Delivery", "meters,", "environment.", "Protocol", "congestion.", "computing", "[37]", "automation,", "59\u001572.", "(IoV)", "mission-critical", "rapid", "Additionally,", "mance", "(2)", "widely", "7,", "industries", "encoding,", "Fujitsu", "protect", "98,", "Zhang", "device-driven", "wireless),", "2018.", "[54]", "characteristics", "come", "oped", "rience", "communication", "example.", "10.1109/TELFOR.2017.8249316.", "(``Applications''),", "corporate", "questions", "applications'", "75964", "[11]", "HI,", "advantages", "gories,", "comput-", "deep", "112\u0015116,", "optimization", "78\u001581,", "management,", "production", "Singapore,", "sys-", "12.", "MCC,", "Mahler,", "previ-", "[16],", "method", "Benamar,", "(WITS)", "architectural", "103\u0015130.", "battery", "considerable", "technique.", "Goyal,", "forward", "business", "Life", "may", "WHMS", "increasing", "Computing''),", "aspects", "estimating", "topic", "evaluations", "ity", "faces", "viewer", "can", "sectors.", "students", "ON,", "consist", "solve", "objective", "year", "amid", "everywhere", "ogy", "implications", "regarding", "VI.", "describe", "base", "(Nova", "details", "Electron.", "Bandwidth:", "during", "cloud-backed", "5820\u00155864,", "IFIP", "simulation", "Flavio", "telecommunica-", "short", "level", "mobile", "should", "(WHMS)", "continuously.", "272\u0015279,", "third", "Beg,", "Other", "proliferating", "Dew", "help", "Information", "end-users", "If", "nition,", "dissemination)", "images,", "(IFIP", "Security,", "stored", "paradigm,''", "devices).", "respectively.", "Tran,", "potential", "H.", "Shanghai,", "wireless.", "sumption.", "Scholar.", "HTTP", "span,", "measure", "Unit", "Mao,", "standardization", "needing", "tech-", "depending", "min-", "NEAR", "Perera,", "20,", "FC-based", "Secci,", "Bagdonas,", "protection", "Janevski,", "espe-", "deadline", "IX.", "(HotWeb),", "over,", "gap.", "platforms", "rate", "surrounding", "done", "frame,", "suf", "Standards", "K.", "suggested", "(cloud", "[42]", "better", "``F-FDN:", "suitable", "showing", "[91].", "75966", "proposed", "Healthcare.", "focus", "Trade", "far", "audiences", "compare", "ments.", "deployments", "minimize", "vehicular", "(IM),", "Extend", "addresses,", "tuned", "Parashar,", "Dastjerdi,", "Tenhunen,", "additional", "[110].", "architectures\u0016A", "computers", "connectivity", "doses", "BANDWIDTH", "strongly", "advantage", "L.", "Salehi,", "func-", "power", "bro-", "He,", "minus", "Things,''", "EC", "Eng.", "standardization.", "Ivanov,", "sensors,", "N.", "commu-", "anomaly", "Gener.", "results", "protects", "since", "Liet", "established", "elds", "F-FDN", "Low-cost", "serve", "Sasaki,", "reason", "Jacobi", "Beyazit,", "UKM,", "particular", "So", "weight", "imize", "Ilin,", "security", "classi", "``Cost-ef", "Its", "paradigms:", "[93]", "Teknologi", "presents", "norms", "Quart.,", "milliseconds", "mixed-integer", "hire", "problems,", "detailed", "Per", "zero.", "From", "nition:", "default", "technologies,", "seven-step", "Tech-", "retrieval", "games.", "``Play", "Prototyping", "cost-effectiveness,", "Z.", "Island,", "Session", "JOURNAL", "WIE,", "hosted", "healthcare.", "``Scalable", "Federate", "picked", "fostering", "those", "553\u0015564,", "J.-W.", "Latency", "4254\u00154265,", "possible", "Verma,", "ponents,", "lay-", "Kurapeev,", "licensed", "unload", "place", "aspect", "Received", "mistakes,", "Max", "environments", "function", "optimizations", "Rindos", "other", "path", "vari-", "Jiang,", "residents", "questions.", "industries,", "ronment", "retains", "strict", "within", "almost-actual", "contribution", "1\u001517,", "``Mobile", "dealing", "safeguarding", "ments,", "analysis,", "approach:", "application", "Beagle", "layer", "5:", "[94].", "extensions,", "2017-2022,", "excellent", "paradigms", "mounted", "realizing", "eligibility", "solutions.", "conclusion", "Multimedia,", "2015,", "protecting", "9206\u00159222,", "Instantly", "delay-tolerant", "store", "CONCEPT", "multi-access", "vided", "we", "summarized", "extraction", "threats", "low", "Cooperation", "[21]", "nds", "82721\u001582743,", "sorted", "111763\u0015111782,", "scheme", "syn-", "multitier", "well-known", "ca-", "detect", "require", "1)", "stands", "while", "reality", "playback.", "[57].", "(DO)", "graphical", "performance.", "p.", "44,", "port", "upon", "collaborating", "testing", "standard", "manuscript", "ONLINE", "108\u0015119,", "detecting", "1\u00156,", "fog:", "MRQ", "experience", "context,", "review", "neighborhood", "examples", "ble", "mission", "They", "act", "trending", "gaming,''", "instead", "divisions", "variables", "Bousselham,", "publication", "Nielsen", "both", "``Cost", "Energy-Aware", "Algorithm", "460\u0015465,", "[49]", "order", "compulsory", "James,", "2Department", "pushing", "vertical", "transmitted.", "region", "not", "FC,", "Tanwar,", "utility,", "cloud", "symposium", "whereas", "heavy", "easier", "module", "IEEE),", "architec-", "Faezipour,", "region's", "DC", "properties", "mechanism", "inProc.", "hotness,''", "computers.", "on-Demand", "7266\u00157281,", "gather", "general,", "Le,", "congestion", "Ridhawi,", "responsi-", "hard", "Technol.,", "near-real-time", "ubiquity", "packets", "biomarkers.", "CC,", "adapted", "tions,", "10.1109/EUROCON.2017.8011159.", "dynamic", "Buchinger,", "REAL", "reaction,", "sensors.", "events", "Shamshirband,", "1\u00159.[44]", "chronization", "developers", "reach", "functionality", "distinct", "Lastly,", "traditional", "in", "effect", "Bonomi,", "Sahambi,", "conducted", "means", "public", "Inf.", "Taiwan,", "IOP", "seven", "10.1109/PER-", "articlescompared", "straightforwardly.", "use", "applications:", "millisecond.", "Min", "``Assessing", "Marin-Tordera,", "Society", "2021),", "Cloud.", "different", "clouds.", "D", "pp.", "discussion,''", "Award", "vol.", "72,", "knowledge", "5G,''", "Melbourne,", "essen-", "according", "reducing", "[17].", "domain.", "physi-", "enabler", "home:", "client", "Ad-hoc", "top", "[97]", "M.Sc.,", "perform", "ness", "centers.", "satisfying", "enormously", "questions,", "Toward", "data,", "edge.", "generally", "integrity", "tems,", "25th", "Mar.", "Switzerland:", "included", "Ristaniemi,", "2021).", "effec-", "``STLS:", "hybrid", "10.1109/CRC50527.2021.9392534.", "rst-author", "Research", "side,", "linearized", "egy", "Bangi", "scene", "current", "sharing,", "applications", "summary,", "achieve", "Commons", "Networks", "Pe\u00f1a-L\u00f3pez,", "trends,", "grid", "P2P-based", "Karsai,", "NASER", "ICCC", "comes.", "games", "Veh.", "Medium", "entire", "030-18400-1_62.", "Electr.", "5000", "10.1109/SEGE.2017.8052825.", "Time", "running", "control", "beyond", "administration,", "area", "activityoccur", "play", "mentioned", "Cao,", "[57]", "Tokyo,", "downtime,", "which", "Users", "discharge", "Letaief,", "B.", "specif-", "C.", "protocols.", "neural", "Lin,", "Sheikh,", "[52].", "real", "oad-", "application,''", "require-", "Cyber-Physical", "strate", "Ray,", "web.", "ogy),", "remote", "IoT", "loop", "tens", "Ph.D.", "Hanoi,", "seventh", "proved", "sector,", "complementary", "Ven\u00a3kauskas,", "tact", "algorithm", "complexity,", "VIC,", "COMW.2018.8480288.", "myse-", "ubiquitous,", "Design,", "circumstance", "phases", "Control", "level,", "advances", "ously", "Cham,", "8\u001516,", "de", "expresses", "destination.", "problem.", "database", "with", "consumptionrelevant", "Method", "Computer,", "servers.", "lives", "Emerg.", "analyzed", "Optimization", "rence", "causes", "unequaled", "[113].", "domain,", "combin-", "constraints.", "Eng.,", "(RREP)", "Y.-J.", "great", "System", "Entrepreneurship", "unique", "Shi", "Funda-", "ef", "abstract", "9882\u00159910,", "Many", "Health:", "317\u0015332,", "(e.g.,", "solution.", "White", "It", "monkey", "ker", "``Challenges", "purposes,", "[91]", "accessed", "Fung,", "typically", "formulating", "Monitoring", "minimizing", "Jul.", "SaaS", "nizations.", "industry,", "self-driving", "systems'", "LATENCY", "Abuzneid,", "(MIC)", "TERMS", "therefore", "http://www.cisco.com/c/dam/en_us/solutions/trends/iot/docs/", "end-device", "theoretically", "Rodero-Merino,", "19,", "[31]", "software-", "capacities.", "replacement", "locally.", "science,", "electronics,''", "Simul.", "contrast", "omnipotent", "evaluated", "``Video", "network,''", "Tokyo", "June", "revolutionize", "Distributed", "2022", "personal", "intrusions,", "56,", "IN", "DC.", "areas.", "Appl.", "related", "video", "17th", "understanding", "advancement", "signif-", "lance,", "[109]", "Qamar,", "obtain", "dis-", "certain", "Senna,", "(IoT", "when", "Chronopoulos,", "ICN", "inside", "taxi,", "many", "procedures", "Access", "Almuraykhi", "but", "[52]", "[90]", "ciency,", "facilities.", "processor", "healthcare", "(MCPSs)", "par-", "Belgrade,", "overcome", "billion", "Considering", "gridand", "Li,", "1728\u00151739,", "ADVANTAGES", "authors", "nal", "Principles,", "architectures", "quality", "computing:", "W.", "importance", "service.", "streaming,''", "solutions,", "applications/services,", "communicate", "9.", "with,", "1", "virtual", "in.", "cost.", "15,", "ture", "measuring", "Home", "Some", "students.", "tional", "lead", "[92]", "manufactur-", "tions", "allowed", "trends", "Plat-", "trend", "(MySET),", "amount", "home's", "You,", "[105]", "heuristics", "meta-heuristic,", "cs", "cache", "(GA)", "QUANG", "offers", "Rezgui,", "system,", "collaborate", "heuristic", "Chadha,", "Towards", "utilize", "best", "devices.", "body's", "6.", "light", "aggregated,", "1005\u00151019,", "Guan,", "information,", "Another", "Int.", "101968.", "Service,", "essentials", "Xuet", "intelligently", "refers", "consideration", "open-source", "class", "[38]", "disadvantages.", "environments:", "response", "``Internet", "advantages,", "decision-making", "intelli-", "Road", "10.1109/TSUSC.2019.2907405.", "(AIAM", "requirements", "hardware", "perfor-", "direction.", "limitations", "calculated", "Prod.,", "drawback", "State-of-the-", "closer", "UKM.", "lets", "likewise", "three", "data.", "answer", "ser-", "tried", "protocol.", "Workshop", "mode,", "unnecessary", "guarantee", "iterative", "Haiying", "This", "it.", "hotness,", "comprehensively", "(CC)", "challenges,''", "Mouradian,", "[6]", "[82]", "RELIABILITY", "Deputy", "lightweight", "once", "Attarbashi,", "network's", "network,", "measures", "became", "SIGCOMM", "used", "P.", "capacity", "practice", "healthcare,", "more", "characterized", "Theory,", "Bruegge,", "Hassan,", "divided", "editorial", "considers", "also", "takes", "content,", "(GLOBECOM),", "decrease", "Ohrid,", "INTRODUCTION", "plant", "Westerlund,", "et", "scarcity", "Definitions.", "Architecture.", "buildings,''", "execution", "(EDGE),", "time.", "com-", "Assistant", "Baccarelli,", "relia-", "[58].", "There", "functionally", "Pagoda", "detection", "140,", "[65].", "increasingly", "Video", "Glitho,", "ber", "``Latency-aware", "LTE.", "(Basel,", "display,", "1\u001521,", "evaluates", "PARADIGMS", "expressed", "n,", "mapping", "seek", "endpoints,", "lighting,", "[32]", "(Honor", "placement", "Barri,", "TABLE", "working", "using", "disadvatnages", "10.1109/TBDATA.2020.2990558.", "grab", "Pro-", "Topic", "digital", "Besides,", "tion", "Malaysia,", "[114],", "4,", "as", "5.", "horizontal", "envi-", "[110]", "connect", "considered,", "uni", "suggest", "Cities", "69,", "location,", "enable", "inevitably", "appliances", "sen", "put.", "ned", "users'", "workload", "Garg,", "performed", "architecture,", "promote", "aspect,", "performance-effective", "complicated", "Position", "tem", "discrete", "T.-A.", "289\u0015330,", "drones,''", "Professor", "payment", "(DC)", "HAFIZAH", "policy", "omnipresent", "handheld", "websites.", "access", "Malekian,", "Reliability", "improve", "Jue,", "feedback", "Although", "Lately,", "ANET", "centers'", "[12].", "Advancement:", "speci", "effective", "network-", "end-users;", "comprising", "devoted", "cyber-physical", "Dustdar,", "Inter-", "tems", "have", "biggest", "take", "Sensors,", "Davy,", "Editor", "environment,''", "Using", "Direct,", "Concepts,", "technology.", "Klimenko,", "arti", "1st", "sin-", "Gilbert,", "Networking),", "crucial", "[113]", "Fundamentals,", "mall,", "high-speed", "wherein", "tructure.", "ROSILAH", "Affairs", "European", "lled", "Games", "2322\u00152358,", "Sensors", "mizing", "MANET,''", "75980", "CEEE.2018.8515768.", "divide", "introducing", "latency,", "formulate", "units", "5", "V", "protocol", "overall", "(B5G)/6G,", "Ahmed,", "2015-2020", "Hasan,", "Near", "time,", "extension", "[3]", "signi", "homes,''", "Alpcan,", "consumption", "Islam,", "completion", "[12]", "Architecture,", "automated", "architecture,''", "V,", "intelligent", "researchers'", "contributed", "solar", "cate-", "(PTP),", "developing", "operates", "organizations", "Athens,", "[Online].", "runs", "While", "Open", "cars", "gateways", "Data", "[2]", "cause", "example", "Telecommunications", "Net-", "Ceselli,", "``Resource", "Singh,", "thanks", "72\u001579.", "literature.", "Ilyashenko,", "therapy", "computing.", "10.1109/ICC-", "3,", "support", "a", "ciency", "securely", "condition", "2005.", "displaying", "piece", "bandwidth", "(QoS).", "responses", "delayed.", "Bonomi", "1\u00159,", "APPLICATIONS", "tomer", "[86].", "case", "Otoum,", "Pre-processing", "[7].", "sensing", "South", "follows", "tackles", "networks.", "clock.", "sensor", "greedy", "combination", "researchers", "Kyriazopoulou,", "then", "(ICCCEEE),", "agencies", "[93].", "Kimaro,", "Robotics-based", "Souza,", "Palma,", "publications", "Tashakor,", "sion.", "sat-", "ts", "79%", "issue", "decomposes", "systems.", "encompasses", "discussed.", "academia", "tor", "operated", "[36]", "traf", "uploading", "awareness,", "varios", "8,", "VIDEO", "stored.", "integration", "Masip-Bruin,", "Electrical", "``Finding", "achieving", "10.1109/Smart-", "allocation", "allows", "good", "Because", "Engineering", "world", "few", "addressed", "issues,''", "actions", "Things.", "opportunities", "see", "IEEE,", "section,", "Streaming", "extension,''", "[6].", "vehicles.", "Catalyst", "run", "Fog", "surveil-", "conceived", "duration,", "studieson", "approaches,", "methodology", "Hassan", "them", "18\u001520,", "``2020:", "formance", "machine's", "[18]", "consider", "Pract.", "Kuala", "objects", "1789\u00151796,", "ltering", "Placing", "asymptotic", "Taichung,", "imizing", "so", "real-time", "S.", "Addressing", "[38].", "Computingdecreases", "online", "[14],", "9364\u00159375,", "Examiner", "Next,", "Second,", "[40]", "Souza", "Park,", "Grid", "T.-A.-N.", "Dang,", "enhanced", "principle", "ITU-T", "stream", "IEEEXplore,", "62,", "expand", "future", "(ICTs)", "meet", "fundamental", "Hospital", "intensity", "manufacturing", "latest", "intensive", "Hussain,", "device", "[84]", "Mohammed,", "529,", "until", "(QoE)", "Fadlullah,", "cept", "Temporary", "[102].", "13\u001516.", "latencies", "i.e.,", "T.", "c.", "4.0", "summarizes", "time", "[90].", "27\u001532,", "Del", "Ramirez,", "China,", "64461\u001564474,", "102582.", "directly", "processed", "from", "survey,''", "supposed.", "associated", "approaches", "Kazmi,", "Japan", "productivity", "Her", "Fog,", "As", "comparison", "tial", "at", "SAC.2015.173.", "Xu,", "performance", "10.1", "Yuhua", "[69]", "[42].", "environment,", "4.", "Sharif,", "On", "sending", "Lin", "Japan,", "problems", "computations", "wearable", "022070.", "throughout", "Hassija,", "Yang,", "``Handling", "10.", "chical", "[56]", "Zeng,", "9,", "Shortening", "MAC", "various", "conferred", "stable", "lems,", "system.", "Fog-computing-based", "``Energy", "realized", "IV.", "cations.", "issues,", "charged", "primary", "FC's", "term", "Smart", "consists", "works,", "ferred", "across", "based", "Circuits", "relevant", "trend.", "store,", "Genetic", "2943\u00152958,", "Data,", "M.Sc.", "Mixed-Integers", "Fog-based", "motivation", "Davis,", "union", "caching", "Tang", "Challenges", "COMMUNICATIONS", "second", "storage,", "goal", "491\u0015494,", "unclear", "(Smart-", "cloud-based", "services.", "effectively", "algorithms.", "4th", "[79]", "mation", "social", "(EAI).", "gives", "potential,''", "execution,", "andV", "Commun,", "member", "facilities", "Canali", "thorough", "Mobile", "scienti", "50", "informa-", "uenc-", "[87]", "[74]", "public,", "metry,", "mentation", "decreases", "developed,", "Rahmani,", "Shatt", "another", "observed", "[99].", "Big", "vey", "Socialinform.,", "Zhai,", "2:", "Shu,", "multiple", "System:", "studied", "26\u001533,", "A.-M.", "intelligence,", "ETSI.", "Edge", "2019,", "stated", "Science", "our", "75971T.-A.", "(2x)", "(RTT)", "Strengthening", "sum", "Saudi", "user", "55,", "Energy", "components", "intrusion", "reliability", "selected", "hierarchical", "ni", "Akhtaruzzaman,", "Software", "Afterward,", "panels.", "receive", "funded", "SELECTED", "Bagile,", "signals", "[48]", "Milito,", "Strathclyde,", "needs", "sug-", "are,''", "healthcare\u0016A", "Speaker", "[2],", "Dinh,", "communication,", "an", "plays", "Jain,", "Wu,", "tecnology.", "Data)", "pre-", "[14]", "[60]", "25,", "distribution", "fog", "coordinating", "Publishers,", "sit-", "overhead,", "Khan,", "&", "``Distributed", "Pinheiro,", "sleep", "(RSP),", "extraction,", "sig-", "[100].", "(APSCIT)", "peo-", "master's", "inputs", "ISSUES", "follows:", "scientists", "will", "Liu,", "ongoing", "Director", "[4]", "operating", "phase", "Results", "(EUROCON),", "30", "journal,", "transformation.", "shown", "blocks", "investigated", "worth", "geographically", "Computing:", "mathematical", "cult", "Atlantis", "simplicity,", "DEW", "driving", "Awardee", "step,", "connection", "regulates", "COST", "oaded", "\u000fHighlight", "generate", "Vegas,", "adap-", "Abdali", "inef", "offer", "television,and", "called", "Typical", "10", "dan", "concern", "formally", "short,", "pre-processing", "QoE", "Things:", "Jha,", "facilities,", "further", "broadening", "turbines", "812\u0015817,", "Due", "Low", "[111]", "located", "Jayaraman,", "design", "Combined", "task", "currently", "Experience", "641\u0015656,", "makes", "she", "implementation", "(ICN)", "Bluetooth", "advanced", "3)", "Springer,", "Metelko,", "geographic", "particularly", "kind", "seamless", "Model.", "E.", "Chih-Lin,", "developmental", "personnel", "eliminated", "Project)", "save", "contains", "unsupported", "Union", "Table", "contribute", "Latency:", "[95]", "medicine,", "``Secure", "8", "Morrow,", "operate", "integrated", "[85]", "view", "VII", "division", "energy,", "nearby,", "picking", "reduces", "prominent", "understand", "address", "frameworks,", "cial", "Q.", "Raj,", "conditioning,", "engineering", "offered", "Wearable", "Sains", "varies", "businesses", "framework's", "(FCA)", "feature", "Furthermore,", "Index:", "Berlin,", "ACCESS,", "literature", "dif", "``Enabling", "FC.", "Ryoo,", "Rana,", "methods.", "database,", "12", "(GITS),", "Transp.", "Academic", "real-time.", "HEALTHCARE", "creating", "All", "deployment", "retrieving", "[48].", "equipment,", "challenge,", "Nets),", "copying,", "Cost-Makespan", "(FTSM),", "Ibrahim", "provides", "scale", "communi-", "MOBILE", "orga-", "period", "priority.", "Then", "[23].", "battery's", "examining", "NGUYEN", "reliability,", "Wadhwa", "attention", "Walters,", "tasks", "storing,", "Sub-Research", "Pescap\u00e8,", "daily", "3.", "ring", "10.1109/ICSSA45270.2018.00021.", "\u000fInvestigate", "modern", "energy-intensive", "u-", "1550147717742073.", "Only", "Moreover,", "uses", "Grant", "7.", "design,", "environment:", "Man,", "dispatching", "privacy-preserving", "16\u001524,", "impossible", "industry.", "Thus", "management", "Ltd.,", "Without", "Particle", "start", "attempt", "75975T.-A.", "computational", "summary", "challenges,", "dilemma.", "requests,", "358,", "18,", "Sakaka,", "Egypt,", "January", "concept", "power,", "involving", "ence", "communications", "ects", "Infrastructure", "SMART", "organize", "Request", "Node", "specifying", "paradigm.", "carefully.", "batteries", "IoT's", "queries", "auto-", "chosen", "5G,", "[49].", "privacy:", "Gupta,", "cities,", "Hanyang", "cities.", "decreased", "extended", "cookies", "use.", "arrival.", "machine", "INDEX", "close-", "[89]", "Internet.", "Brazilian", "railway", "on", "technological", "end,", "Virtualization", "algorithms,''", "model,", "search", "coordination", "methodologies", "[114]", "managing", "streaming,", "adequate", "largely", "Mahmud,", "Special", "home.", "[11].", "discussed", "Vehicles", "its", "selection", "transfer-", "Polakos,", "VOLUME", "sources.", "usability", "Questions", "providers", "send", "expense", "despite", "words,", "the", "edge,", "(1)", "x2R(2x)", "methods,", "``Strategy", "maximizing", "forwarding.", "queuing", "addition,", "Tuts.,", "interactive", "operations", "ing", "early", "Ding,", "Sudan,", "94,", "School", "factor", "lacking", "cities:", "Computing.De", "ANET,", "1\u00155.", "art", "Malaysia", "Veillon,", "pedestrian", "gathering", "10.1109/IEEE.EDGE.2017.12.", "manage", "two", "games,", "is,", "lost,", "B.Sc.", "Incentives", "communities", "new", "reliable", "others,", "occurrence", "[81]", "``Multitier", "principles,", "Forecast", "produced", "External", "International", "ACM", "implementation,", "J.,", "Gu,", "optimization/multi-", "life,", "rather", "ates", "(FDN),", "purposes", "article", "75976", "light-based", "2020.", "localized", "complications", "display", "inter-", "theory,", "milliseconds.", "26\u001535,", "(JSAC),", "B.-G.", "grid.", "2020,", "diminished", "Muniyandi,", "layer:", "applica-", "Chiang", "New", "[36].", "founded", "doi:10.1109/ICCE.2018.8326056.", "accelerate", "steps", "NP-hard", "local", "VEHICLES", "easily", "logic", "Tucker,", "treatment", "COVID-19", "move", "For", "Pre-", "request", "host", "[71]", "premise", "net", "Sel.", "communities.", "[94]", "underlying", "ne", "l-", "value", "Laboratory.", "differences", "less", "Proximal", "complexity", "devel-", "precise", "Yadegaridehkordi,", "world,", "signs.", "Lumpur,", "long-term", "[64]", "representation.", "Seitz,", "Sci.", "Al-Khaleefa,", "Fall", "constantly,", "Young", "2015", "opportu-", "Psannis,", "analytics", "determine", "decomposition", "Aron,", "software.", "Associate", "Internet", "3", "risks", "1674,", "Asia-Paci", "Subsequently,", "[31].", "jour-", "things,", "operation.", "pre-diagnose", "Technology", "(ICSESP),", "Ghosh,", "information", "Aazam,", "mobility", "sec-", "translations.", "Proposed", "Switzerland),", "title", "Sargento,", "degrees", "device.", "state", "CLOUD", "set,", "follow:", "several", "Lecturer", "charge", "risk.", "Stergiou,", "bus", "vice,", "capability,", "become", "survey", "AND", "There-", "line,", "comfortable", "Reply", "functional", "years,", "intelligence", "[5]", "solution", "dew", "Commission's", "plied", "17\u001524,", "maintain", "gam-", "educational", "Autonomic", "complement", "[45].", "Guet", "study", "Frontiers", "10200\u001510232,", "Computing.", "high", "[32];", "[101].", "lacks", "Library,", "lights", "sev-", "Main", "transfer.", "oading", "correspondingly", "nite", "integration,", "(EUSPN),", "continuum", "CONCLUSION", "Yangui,", "10.1007/978-3-", "smartphones,", "connec-", "interconnectivity", "urban", "extensive", "[108]", "``The", "desires", "49\u001552,", "increases", "MANET.", "wireless", "event.", "server", "through", "Waseda", "28,", "although", "formats", "infrastructure.", "homes", "[61].", "hierarchy:", "Balancing", "behav-", "Fang,", "Intl", "available.", "tier", "Monkey", "data's", "combined", "Xia,", "11.", "administrations,", "authentication", "enhancement", "concern,", "taxonomy,", "Archit.,", "paper", "water", "[76]", "solutions,''", "``Computational", "if", "clarify", "558,", "El", "Attribution", "author:", "large", "shared", "Shin,", "\u000fPropose", "making", "Topics", "109/ACCESS.2021.3081770", "25%", "D.", "Samsung", "net-", "who", "endanger", "Object", "75970", "[59].", "nodes.", "[9]", "His", "VMs", "scalability,", "[27].", "step", "services,", "ICT4D", "end-user", "expected", "IoV", "tions'", "delays", "technologies", "imple-", "2021", "Ferrari,", "illus-", "[100]", "bene", "Amsterdam,", "function's", "deliver", "infringement,", "realization", "Series", "zone,", "respect", "[88]", "Economy,", "Barnawi,", "Mauri,", "Basra,", "sensors", "highly", "cooperative", "Feb.", "Vehicle", "assets,", "location-aided", "aware", "cal", "applications/services", "Layer", "affecting", "even", "maximize", "collection,", "854\u0015864,", "communication.", "irrespective", "ously,", "Security", "Integr.", "equal", "networked", "lively", "bears", "sen-", "ICT", "39th", "27\u001542,", "embedded", "1826\u00151857,", "Institute", "instruments", "CA,", "Guest", "two-phase", "Pay", "tools", "Power:", "differently.", "retain", "Decem-", "Southern-Driven", "coverage,", "like", "petroleum", "bed", "[65]", "Instead,", "Consequently,", "wire-", "nite,", "existence", "live", "Iraq,", "jahtera", "numbers", "literature,", "University.", "set", "is", "Chiang,", "``All", "Honolulu,", "heterogeneous", "test", "collaboration", "dependent", "puter", "(ISC),", "[43]", "held", "solving", "Sovi\u00a2,", "Mokhtar,", "satisfy", "environments.", "Route", "realize", "[59]", "IoT-connected", "categories:", "QoS", "individual", "2", "SECURITY", "Akhlaq,", "Infor-", "most", "cation", "Saeed,", "[20]", "transport", "body", "analysis.", "years.", "SRQ.", "Internet-of-", "extending", "Naiman,", "ECG", "areas,", "ing,", "green", "Secondly,", "[19]", "commercial,", "collects", "resolution", "savings", "IoT:", "964\u0015975,", "transmitted", "Microservices", "IFIP/IEEE", "Netherlands:", "relating", "F.", "D0;", "representatives", "interact", "fourth", "Further", "COMPUTING", "es", "Aloqaily,", "Ha,", "nicating", "[106].", "Manage.", "FDN", "swarm", "customer's", "Ministry", "graphics", "busy", "updates,", "awareness.", "locally", "75969T.-A.", "Yousefpour,", "Magazine.", "``Energy-ef", "reduce", "ight", "internet", "program", "type", "[92].", "possesses", "c", "propose", "delay,", "such", "spectrum", "above", "Multipliers", "29,", "2018", "2nd", "(ICC),", "sub-server", "Advances", "Informat.,", "Jose,", "sive", "human", "``FCSS:", "supported", "les", "ensures", "layers", "receiving", "computing's", "need", "complicated,", "streetlights.", "pro-", "conver-", "latency-sensitive", "system-wide", "linear", "Forum", "Melnik", "network", "During", "could", "(SaaS),", "2014", "2014.", "munication", "mobility,", "text,", "limits", "output", "Switzerland,", "47980\u001548009,", "Board", "ASE", "IET.", "vision", "created", "accepted", "up", "OPTIMIZATION", "puting", "Piran,", "costs", "complete", "cially", "connect-", "implemented", "Singapore:", "fth", "end", "hospital", "security,", "Langkawi", "These", "solutions", "nectivity,", "[99]", "centers", "Building", "AMAN", "(SMART-", "complex", "constructions,", "actively", "published", "challenges", "considered", "Tang,", "Oshawa,", "FIGURE", "Visual", "Iqbal,", "consumes", "Naranjo,", "pressure,", "NGOC", "II,", "Chauhan,", "weak.", "Workshops", "decision.", "real-life", "scaling", "cloud-to-the-things,", "Idrissi,", "``Edge-computing-enabled", "around", "[87].", "Sikdar,", "le-based", "[58]", "Alturki,", "for", "[44].", "way,", "ior", "Stojkoska", "Pervasive", "generated", "anything,", "Rezgui", "distant", "Different", "execution.", "Cisco", "Trends,", "Altayeb", "Ayre,", "Electronic", "collected", "tects", "ultimate", "among", "fast", "enclosed", "(IP)", "hospitals", "lter", "distance", "deploy-", "emerg-", "Geneva,", "(ICIT),", "Afgan,", "[30]", "(ISPA/IUCC/BDCloud/SocialCom/SustainCom),", "ciently", "smoothly.", "frame", "``Low-latency", "(work-in-progress),''", "posed", "Mahmood,", "Cloud", "separates", "selectively", "how", "house", "applied,", "2021,", "recent", "Gia,", "She", "unit", "dispatcher,", "Process.", "demands", "renewable", "3%", "instance,", "[27]", "Shen,", "Kebangsaan", "Quality", "malware.", "[7]", "B.Eng.", "section.", "anticipated.", "introduction", "Morkevicius,", "paradigm", "fusion", "dictable", "Verma", "IEEE", "middleware", "Denninnart,", "I.", "memory,", "servicesbased", "Speci", "optimize", "edges", "Healthcare", "devices,", "create", "Zhao,", "Harras,", "10.1109/CloudNet.2016.36.", "Internal", "programming", "patients", "tough", "devices'", "B.Eng.,", "15\u001520,", "(MBoT),", "(METI)", "Cai,", "Sari,", "Hefferman,", "poor", "screen", "(ADMM).", "[80]", "Y.", "Center", "Scholarship", "users,", "dissemination", "2012,", "balancing", "Distrib.", "ine", "Q.-V.", "bandwidth,", "De,", "model's", "drone", "utilities,", "6,", "cision", "initial", "exible", "Softw.", "reliable,", "why", "Elbeqqali,", "sorting", "ex-", "robust", "user's", "distributes", "uencing", "pared", "(2015-2021)", "4:", "2016.", "[41]", "informs", "Ngo,", "entitled", "measurement,", "Limited", "Manufacturing", "cases.", "computation", "Cloud,", "Elsevier,", "transferred", "organization", "into", "A.-S.", "Akbar,", "close", "below", "instantaneously", "latency-aware", "cally,", "Braten,", "``Bandwidth", "still", "execute", "gested", "utilization", "contributions", "responsible", "FCg", "latency.", "(UKM),", "community", "cacy.", "78,", "Handbook", "1999,", "(LP)", "Telecommunica-", "where", "(ICSSA),", "[102]", "10,", "1\u00157,", "in-depth", "Symp.", "INTERNET", "lot", "adaptive", "certainty", "cars,", "transmitted,", "docu-", "routing", "illustrates", "depart-", "inertia.", "Phys.,", "Annual", "geo-", "Innovation", "Al-Arab", "journey", "``Smart", "1\u00156.", "broadband", "platforms,", "transmis-", "no", "computer", "1\u00154,", "assistance", "Associate,", "load", "know", "decision", "enabling", "uncontrolled", "focusing", "calculation", "demonstrate", "design.", "cases,", "problem", "Computing-based", "Ren,", "change", "lining", "[13].", "[47].", "are", "Buyya,", "street", "(Big", "end-services", "[20].", "strategies", "visualization", "simula-", "navigation,", "State-of-the-Art,''", "10.1109/ICC.2016.7511465.", "Aman,", "analyzing", "ple", "culties", "reduced", "harsh", "minology", "[16]", "discusses", "edge:", "R.", "Wi-Fi,", "Systems", "received", "scheduling", "(AI),", "might", "facilitate", "unlimited.", "challenge.", "layers.", "Various", "enough", "technology.\u000fAddress", "Intell.", "demon-", "death", "perspective", "comprehensive", "enables", "Layer,", "[75]", "tuple,''", "conference", "service,", "2017.", "https://creativecommons.org/licenses/by/4.0/75961T.-A.", "increase.", "approach", "volume", "laid", "places", "direction", "tness,", "agement", "requires", "gaming", "inclu-", "answers,''", "together", "Kelner,", "2020),", "leads", "demand", "oping", "E.-N.", "possibilities", "processes", "driving,", "fog-cloud", "architecture.", "process-", "lance", "Innov.", "61\u001575.", "future,", "heuristic-based", "[101]", "Butun,", "important", "appli-", "Application", "proximity", "Kraemer,", "Addaim,", "autonomous", "heterogeneous,", "networks,", "collaborative", "Direction", "frequently", "[33].", "vital", "end-to-end", "cycle.", "Highlights", "union,''", "Advanced", "book", "virtualization", "performance's", "[64].", "A.", "[10].", "bright", "issues.", "level.", "tions.", "content", "More-", "attachment", "platform", "2019.", "[10]",